import pyparsing as pp
from pyparsing.unicode import pyparsing_unicode as ppu
import re
from apparatus_classes import *
import importlib

nums = pp.nums
alphasnums = ppu.Hebrew.alphas + nums + "'?!\":,;.ֵַּׄׄ"

# Define the grammar for a Hebrew word
hebrew_word = pp.Word(alphasnums)
bold_word = pp.Suppress('*') + hebrew_word + pp.Suppress('*')
hebrew_sentence = pp.OneOrMore(hebrew_word | "..." | "[!]").setResultsName("regular")
italic_sentence = '_' + hebrew_sentence.setResultsName("italic") + '_'
strike_sentence = '~' + hebrew_sentence.setResultsName("strike") + '~'

complex_sentence = pp.OneOrMore(italic_sentence | strike_sentence | hebrew_sentence)
pp_variant_apparatus = pp.Group(complex_sentence).setResultsName("text") + pp.Group(pp.OneOrMore(bold_word)).setResultsName("sources")
pp_lemma_apparatus = pp.Group(hebrew_sentence).setResultsName("lemma") + pp.Suppress(']') + pp.OneOrMore(pp.Group(pp_variant_apparatus)).setResultsName("variants")
pp_line_apparatus = pp.Word(nums).setResultsName("line") + pp.delimitedList(pp.Group(pp_lemma_apparatus), delim=pp.Suppress('/')).setResultsName("lemmata")
pp_title_apparatus = pp.delimitedList(pp.Group(pp_lemma_apparatus), delim=pp.Suppress('/')).setResultsName("lemmata")
pp_full_apparatus = pp_title_apparatus.setResultsName("title_apparatus") + pp.OneOrMore(pp.Group(pp_line_apparatus)).setResultsName("lines")

# אלוה עז
# test = 'וערצ\'ה ... ותשע] וקרהו מה שהוא ידוע ומפורסם עם זוהמיר אדון אלמחסה על יד אבן עבאס סופרו וכאשר הצילו השי"ת אמר זה המשקל יספר בו ענינו עם שניהם ומה שזמן ה\' לידו להתעולל עליהם והיה הנצוח הנכבד הזה בקר יום ששי ראשון לאלול שנת תשצ"ח ~וקרה~ וקרא זה המשקל שירה _ובצד נוסף:_ ויש בו קמ"ט בתים *ש* / אבן] בן *ק* / אל קטעה] הד\'ה אלקטעה *ק* / כתאבהא] כתאבתהא *ק* / תעאלי] תעלי *ק* שבע ... ותשע] תשצ"ט *ק*   1 עוז] עז *ק*   4 בשמך] בשמחה *ש*   5 קטנים] ~עצומי~ קטנים *פ*    6 אל] אז *ש* / יתירה] יתרה *ש*   7 חבי] חבה *ש*   8 בתמהון] בתימהון *ש* / יי] ה\' *ש* ייי *ק*   10 כורתים] כורת *ש* *ק* / בריתם] בריתו *ש* *ק* / ולי] ויש *ש*   11 מעשה] מעשי *ש*   12 לחוף] בלב *ק*   14 אינה] לא היא *ק*   18 וחבר] ודבר *ש*   20 זאת] זה *ש*   22 בדה] בדא *ק*   23 להכרית] ..מיד *ה3*   24 האזין] שת _ותוקן בין השיטים_ *ה3* / דבריו] דברו *ק* / החסרה] החסירה *ה3*   25 מעטים] מעוטים *ה3* ביום צרה עכורה] לנפשי העכורה *ש*   31 ואפו] ואפי *ק*   32 כפיר] בפיד *ד2*   34 ושלח ... עבירה] _חסר_ *ד2*   35 שלום] השקט; _יתר הבית מחוק, ומסתבר שסדר המילים הוחלף_ *ק* / גופו] גופה, _ה\' סומנה בשתי נקודות למעלה_ *פ* _נוסח הפנים לפי_ *ש* *ד2*   36 שלח ... פשרה] _חסר_ *ד2* / מדינים] מדיינים *ש*   37 אין] איין *ד2*   38 השיב] א.. *ד2* / שאלתך] שאילתך *ד2* ..אילתך *ג1* / מארה] מאירה *ד2* *ג1*   40 והוקש] והרע *ש* *ק* / לו] לי *ש*   41 חייליו] חיליו *ד2*   42 חפורה] _והמעתיק החל לכתוב_ ע, _זיהה את שגיאתו וסימנהּ למחיקה_ *פ*   43 ומהר] ומיהר *ק* / רוח] כרוב *ש*   46 אהלו] אהלה *ד2*   47 לבבינו] לבבנו *ג1* / כאילו] כאלו *ק* *ג1* / שיארה] שיירה *ש* *ק*   49 צוררי] ~צוררי~ צוררי *ש*   50 אזי] _ראש המילה מחוק_ *פ* _הושלם לפי_ *ש* *ק* *ד2* / חנית רמח] רומח חנית  _ובין השיטים הורה המעתיק על סדר המילים שבנוסחתנו_ *ש*   51 צור] צורי *ד2*   52 החילות] החיילות *ש* *ק* ..חיילות *ד2*   52 צר] _בספק_: צור *ש* / בשורה] כשורה *ד2*   53 יחשבון] יחשבו *ש* *ק* *ד2* / וחמה] וחימה *ש* *ק*   54 מבקש] יבקש *ק*   55 עמרה] עמורה *ש*   56 ופנים ... קדרה] _חסר_ *ד2* / פרור] פארור *ש*   58 סעירה] סערה *ד2*   59 בעמדיה] בעמידה *ד2* / כאלו] כאילו *ד2*   והגבות] והגופים *ד2*   68 בדתיהם] בדתותם *ד2*   70 עתרה] עתירה *ד2*   75 והגיוני] ..יוניי *ד2*   80 פדיני] פדני *ש* / מידי] מן ידי *ש* / קטב] קטבי *ד2*   81 זכר] זכור *ש*   82 עמד] עמוד *ש* *ד2* / לו] לי *ש* / במרורה] במדורה *ש* *ד2*   83 שוכן] שוכב *ש* *ד2* / במכפלה] במשכבה *ד2* / עלו] עלה *ד2*    84 ואמרו] וקראו *ד2*   85 ידידי] ידידיי *ד2*   86 יהוסף] _נכתב_ שמואל_, צוין למחיקה ותוקן_ *פ* / צעירך] צעיריך *ד2*   87 היום] היום היום *ד2* / לעבדך] בזאת לי *ש*   88 שומח] שמח *ש*   89 בושר] בשר *ש* / הישרף] הושרף *ד2*      90 בחמה] בחימה *ד2* / בבעירה] בבערה *ש*   91 דלתות ... צר] דלת במקום צר והושע לעבדך *ק* *ש*   93 וכוכבים] וככבים *ש*   96 כיום] סיום _ומעל הסמ"ך מתוקן כ"ף_ *ק* / והראם] והראה *ש* *ק*   98 כולם] כלם *ש*   99 נמכרו] נמכר *ק*   101 אדנים] אדונים *ש* *ק* *ד2* / ומכים] _בשוליים נוסף:_ מלשון מך *ש* / מלכים] מלאכים *ק* / ברירה] בבירה *ד2*   102 והיו] והיה *ש*   103 בם] בה *ק* / כעוללות] כעולילות *ד2* / בכרם] ~ביום~ בכרם *ש*   108 סלון] סילון *ש*   111 מצאום] מצאו *ד2*   112 וחום] בחום *ד2* / ובעלית] ובעליית *ק*   113 עליהם ... הצעירה] _נוסף בשוליים במאונך_ *ש* / ניני] ילדי *ש* / יענים] יעינים *ק* *ד2* / ותרקוד] ותרקד *ש* *ל2*   114 ויכרו] ויברו _ובשוליים תוקן:_ ויבכוות\' *ש* ויברו *ל2* / לחומימו] לחוממו *ק*   115 וקרקרנו בנקם] והרקדנו בנאם *ל2* / בנקם] ~ב~ בנקם *ש*   117 וחזרנו ולא נפקד] ושבנו מבלי מפקד *ש* *ק* / חברנו] חבירינו *ש* *ק* חבירנו *ל2*   118 וראש] ויום *ש* / בראש] כראש *פ* _נוסח הפנים לפי_ *ש* *ק* *ל2* / כיום] ביום *פ* _נוסח הפנים לפי_ *ש* *ק* *ל2*   191 כמו] כיום *ש* *ק*   120 ויום] ~ומם~ ויום *ש*   121 בא] בוא *ק* / תשע ותשעים] תשעים ותשע *ש* *ק* / אלי] אילי *ל2*   122 להרגני] להרגיני *ל2* / הגזירה] הגזרה *ק*   123 גלח] גולח *ש* *ק* *ד2*   124 תפשתיו] תפשותיו *ל2* / סהר] סוה.. *ד2* / במגרה] במגירה *ד2* *ל2*   126 וכאשר] ובאשר *ד2* / סחרה] סחורה *ל2* / סחורה] סחרה *ל2*   128 ומלא] ימלא *ד2* / קטורה] טהורה *ד2*   129 בככריו] בכיכריו *ד2* / מתי] ומתי *פ* _נוסח הפנים לפי_ *ש* / באגורה] כאגורה *ד2*   130 שררה] שדרה *ל2*    131 זוכרי] זכרי *ל2* / לרעה] ברעה *ד2* / בלאמים] בלאומי\' *ש* בלאומים *ד2*   132 פעולת] פעלת *ד2* *ל2* / מחתתו] מחיתתו *ש* *ד2*   133 תרומית] תרומיית *ש* *ל2*   134 תפיל] הפיל *ל2* / ויחזיק] ותחזיק *ל2* / מהרה] מהירה *ש* *שב"ק*  135 כי] כן *בק1*   136 ושור] _בספק_: ושורר *ש* / אמרו] גמרו *ל2*   137 השירה] השיר *ש* / לשרה] לשירה *ד2*   138 במרבדים] כמרבדים *ד2* / כספירים] בספירים *ד2*   139 ממלאים] ממולאים *ד2*   142 תמולא] תמלא *ש* *ד2*   143 ותודה] ~ב~ ותודה *ש*   144 לו] לי *ד11* / ולתומכים] ולתמוכים *ד2* / לתורה] בתורה *ש* *ד2*   145 וסעף] וסיעף *ד2* / ופארה] ופורה *פ* *ד2* _נוסח הפנים לפי_ *ש*   146 וצען] וצוען *ש* *ד2* ..צוען *ד11*  147 בי רב] בירב *ד2* *ד11* / וסורא] בסורא *ש* בסורה *ד2* *ד11*   148 למקרה] למקרא *ד2* / אחשורש] אחשורוש *ש* *ד2* *ד11*   149 וכתבוה] ובתבוה [!] *ד2*'
# test = '1 עוז] עז *ק*   4 בשמך] בשמחה *ש*   5 קטנים] ~עצומי~ קטנים *פ*    6 אל] אז *ש* / יתירה] יתרה *ש*   7 חבי] חבה *ש*   8 בתמהון] בתימהון *ש* / יי] ה\' *ש* ייי *ק*   10 כורתים] כורת *ש* *ק* / בריתם] בריתו *ש* *ק* / ולי] ויש *ש*   11 מעשה] מעשי *ש*   12 לחוף] בלב *ק*   14 אינה] לא היא *ק*   18 וחבר] ודבר *ש*   20 זאת] זה *ש*   22 בדה] בדא *ק*   23 להכרית] ..מיד *ה3*   24 האזין] שת _ותוקן בין השיטים_ *ה3* / דבריו] דברו *ק* / החסרה] החסירה *ה3*   25 מעטים] מעוטים *ה3* ביום צרה עכורה] לנפשי העכורה *ש*   31 ואפו] ואפי *ק*   32 כפיר] בפיד *ד2*   34 ושלח ... עבירה] _חסר_ *ד2*   35 שלום] השקט; _יתר הבית מחוק, ומסתבר שסדר המילים הוחלף_ *ק* / גופו] גופה, _ה\' סומנה בשתי נקודות למעלה_ *פ* _נוסח הפנים לפי_ *ש* *ד2*   36 שלח ... פשרה] _חסר_ *ד2* / מדינים] מדיינים *ש*   37 אין] איין *ד2*   38 השיב] א.. *ד2* / שאלתך] שאילתך *ד2* ..אילתך *ג1* / מארה] מאירה *ד2* *ג1*   40 והוקש] והרע *ש* *ק* / לו] לי *ש*   41 חייליו] חיליו *ד2*   42 חפורה] _והמעתיק החל לכתוב_ ע, _זיהה את שגיאתו וסימנהּ למחיקה_ *פ*   43 ומהר] ומיהר *ק* / רוח] כרוב *ש*   46 אהלו] אהלה *ד2*   47 לבבינו] לבבנו *ג1* / כאילו] כאלו *ק* *ג1* / שיארה] שיירה *ש* *ק*   49 צוררי] ~צוררי~ צוררי *ש*   50 אזי] _ראש המילה מחוק_ *פ* _הושלם לפי_ *ש* *ק* *ד2* / חנית רמח] רומח חנית  _ובין השיטים הורה המעתיק על סדר המילים שבנוסחתנו_ *ש*   51 צור] צורי *ד2*   52 החילות] החיילות *ש* *ק* ..חיילות *ד2*   52 צר] _בספק_: צור *ש* / בשורה] כשורה *ד2*   53 יחשבון] יחשבו *ש* *ק* *ד2* / וחמה] וחימה *ש* *ק*   54 מבקש] יבקש *ק*   55 עמרה] עמורה *ש*   56 ופנים ... קדרה] _חסר_ *ד2* / פרור] פארור *ש*   58 סעירה] סערה *ד2*   59 בעמדיה] בעמידה *ד2* / כאלו] כאילו *ד2*   והגבות] והגופים *ד2*   68 בדתיהם] בדתותם *ד2*   70 עתרה] עתירה *ד2*   75 והגיוני] ..יוניי *ד2*   80 פדיני] פדני *ש* / מידי] מן ידי *ש* / קטב] קטבי *ד2*   81 זכר] זכור *ש*   82 עמד] עמוד *ש* *ד2* / לו] לי *ש* / במרורה] במדורה *ש* *ד2*   83 שוכן] שוכב *ש* *ד2* / במכפלה] במשכבה *ד2* / עלו] עלה *ד2*    84 ואמרו] וקראו *ד2*   85 ידידי] ידידיי *ד2*   86 יהוסף] _נכתב_ שמואל_, צוין למחיקה ותוקן_ *פ* / צעירך] צעיריך *ד2*   87 היום] היום היום *ד2* / לעבדך] בזאת לי *ש*   88 שומח] שמח *ש*   89 בושר] בשר *ש* / הישרף] הושרף *ד2*      90 בחמה] בחימה *ד2* / בבעירה] בבערה *ש*   91 דלתות ... צר] דלת במקום צר והושע לעבדך *ק* *ש*   93 וכוכבים] וככבים *ש*   96 כיום] סיום _ומעל הסמ"ך מתוקן כ"ף_ *ק* / והראם] והראה *ש* *ק*   98 כולם] כלם *ש*   99 נמכרו] נמכר *ק*   101 אדנים] אדונים *ש* *ק* *ד2* / ומכים] _בשוליים נוסף:_ מלשון מך *ש* / מלכים] מלאכים *ק* / ברירה] בבירה *ד2*   102 והיו] והיה *ש*   103 בם] בה *ק* / כעוללות] כעולילות *ד2* / בכרם] ~ביום~ בכרם *ש*   108 סלון] סילון *ש*   111 מצאום] מצאו *ד2*   112 וחום] בחום *ד2* / ובעלית] ובעליית *ק*   113 עליהם ... הצעירה] _נוסף בשוליים במאונך_ *ש* / ניני] ילדי *ש* / יענים] יעינים *ק* *ד2* / ותרקוד] ותרקד *ש* *ל2*   114 ויכרו] ויברו _ובשוליים תוקן:_ ויבכוות\' *ש* ויברו *ל2* / לחומימו] לחוממו *ק*   115 וקרקרנו בנקם] והרקדנו בנאם *ל2* / בנקם] ~ב~ בנקם *ש*   117 וחזרנו ולא נפקד] ושבנו מבלי מפקד *ש* *ק* / חברנו] חבירינו *ש* *ק* חבירנו *ל2*   118 וראש] ויום *ש* / בראש] כראש *פ* _נוסח הפנים לפי_ *ש* *ק* *ל2* / כיום] ביום *פ* _נוסח הפנים לפי_ *ש* *ק* *ל2*   191 כמו] כיום *ש* *ק*   120 ויום] ~ומם~ ויום *ש*   121 בא] בוא *ק* / תשע ותשעים] תשעים ותשע *ש* *ק* / אלי] אילי *ל2*   122 להרגני] להרגיני *ל2* / הגזירה] הגזרה *ק*   123 גלח] גולח *ש* *ק* *ד2*   124 תפשתיו] תפשותיו *ל2* / סהר] סוה.. *ד2* / במגרה] במגירה *ד2* *ל2*   126 וכאשר] ובאשר *ד2* / סחרה] סחורה *ל2* / סחורה] סחרה *ל2*   128 ומלא] ימלא *ד2* / קטורה] טהורה *ד2*   129 בככריו] בכיכריו *ד2* / מתי] ומתי *פ* _נוסח הפנים לפי_ *ש* / באגורה] כאגורה *ד2*   130 שררה] שדרה *ל2*    131 זוכרי] זכרי *ל2* / לרעה] ברעה *ד2* / בלאמים] בלאומי\' *ש* בלאומים *ד2*   132 פעולת] פעלת *ד2* *ל2* / מחתתו] מחיתתו *ש* *ד2*   133 תרומית] תרומיית *ש* *ל2*   134 תפיל] הפיל *ל2* / ויחזיק] ותחזיק *ל2* / מהרה] מהירה *ש* *שב"ק*  135 כי] כן *בק1*   136 ושור] _בספק_: ושורר *ש* / אמרו] גמרו *ל2*   137 השירה] השיר *ש* / לשרה] לשירה *ד2*   138 במרבדים] כמרבדים *ד2* / כספירים] בספירים *ד2*   139 ממלאים] ממולאים *ד2*   142 תמולא] תמלא *ש* *ד2*   143 ותודה] ~ב~ ותודה *ש*   144 לו] לי *ד11* / ולתומכים] ולתמוכים *ד2* / לתורה] בתורה *ש* *ד2*   145 וסעף] וסיעף *ד2* / ופארה] ופורה *פ* *ד2* _נוסח הפנים לפי_ *ש*   146 וצען] וצוען *ש* *ד2* ..צוען *ד11*  147 בי רב] בירב *ד2* *ד11* / וסורא] בסורא *ש* בסורה *ד2* *ד11*   148 למקרה] למקרא *ד2* / אחשורש] אחשורוש *ש* *ד2* *ד11*   149 וכתבוה] ובתבוה [!] *ד2*'
test = joined_paragraphs[-6]

# test = 'וערצ\'ה ... ותשע] וקרהו מה שהוא ידוע ומפורסם עם זוהמיר אדון אלמחסה על יד אבן עבאס סופרו וכאשר הצילו השי"ת אמר זה המשקל יספר בו ענינו עם שניהם ומה שזמן ה\' לידו להתעולל עליהם והיה הנצוח הנכבד הזה בקר יום ששי ראשון לאלול שנת תשצ"ח ~וקרה~ וקרא זה המשקל שירה _ובצד נוסף:_ ויש בו קמ"ט בתים *ש* / אבן] בן *ק* / אל קטעה] הד\'ה אלקטעה *ק* / כתאבהא] כתאבתהא *ק* / תעאלי] תעלי *ק* שבע ... ותשע] תשצ"ט *ק*   1 עוז] עז *ק*   4 בשמך] בשמחה *ש*   5 קטנים] ~עצומי~ קטנים *פ*    6 אל] אז *ש* / יתירה] יתרה *ש*   7 חבי] חבה *ש*   8 בתמהון] בתימהון *ש* / יי] ה\' *ש* ייי *ק*   10 כורתים] כורת *ש* *ק* / בריתם] בריתו *ש* *ק* / ולי] ויש *ש*   11 מעשה] מעשי *ש*   12 לחוף] בלב *ק*   14 אינה] לא היא *ק*   18 וחבר] ודבר *ש*   20 זאת] זה *ש*   22 בדה] בדא *ק*   23 להכרית] ..מיד *ה3*   24 האזין] שת _ותוקן בין השיטים_ *ה3* / דבריו] דברו *ק* החסרה] החסירה *ה3*   25 מעטים] מעוטים *ה3* ביום צרה עכורה] לנפשי העכורה *ש*   31 ואפו] ואפי *ק*   32 כפיר] בפיד *ד2*   34 ושלח ... עבירה] _חסר_ *ד2*   35 שלום] השקט; _יתר הבית מחוק, ומסתבר שסדר המילים הוחלף_ *ק* / גופו] גופה, _ה\' סומנה בשתי נקודות למעלה_ *פ* _נוסח הפנים לפי_ *ש* *ד2*   36 שלח ... פשרה] _חסר_ *ד2* / מדינים] מדיינים *ש*   37 אין] איין *ד2*   38 השיב] א.. *ד2* / שאלתך] שאילתך *ד2* ..אילתך *ג1* / מארה] מאירה *ד2* *ג1*   40 והוקש] והרע *ש* *ק* / לו] לי *ש*   41 חייליו] חיליו *ד2*   42 חפורה] _והמעתיק החל לכתוב_ ע, _זיהה את שגיאתו וסימנהּ למחיקה_ *פ*   43 ומהר] ומיהר *ק* / רוח] כרוב *ש*   46 אהלו] אהלה *ד2*   47 לבבינו] לבבנו *ג1* / כאילו] כאלו *ק* *ג1* / שיארה] שיירה *ש* *ק*   49 צוררי] ~צוררי~ צוררי *ש*   50 אזי] _ראש המילה מחוק_ *פ* _הושלם לפי_ *ש* *ק* *ד2* / חנית רמח] רומח חנית  _ובין השיטים הורה המעתיק על סדר המילים שבנוסחתנו_ *ש*   51 צור] צורי *ד2*   52 החילות] החיילות *ש* *ק* ..חיילות *ד2*   52 צר] _בספק_: צור *ש* / בשורה] כשורה *ד2*   53 יחשבון] יחשבו *ש* *ק* *ד2* / וחמה] וחימה *ש* *ק*   54 מבקש] יבקש *ק*   55 עמרה] עמורה *ש*   56 ופנים ... קדרה] _חסר_ *ד2* / פרור] פארור *ש*   58 סעירה] סערה *ד2*   59 בעמדיה] בעמידה *ד2* / כאלו] כאילו *ד2*   והגבות] והגופים *ד2*   68 בדתיהם] בדתותם *ד2*   70 עתרה] עתירה *ד2*   75 והגיוני] ..יוניי *ד2*   80 פדיני] פדני *ש* / מידי] מן ידי *ש* / קטב] קטבי *ד2*   81 זכר] זכור *ש*   82 עמד] עמוד *ש* *ד2* / לו] לי *ש* / במרורה] במדורה *ש* *ד2*   83 שוכן] שוכב *ש* *ד2* / במכפלה] במשכבה *ד2* / עלו] עלה *ד2*    84 ואמרו] וקראו *ד2*   85 ידידי] ידידיי *ד2*   86 יהוסף] _נכתב_ שמואל_, צוין למחיקה ותוקן_ *פ* / צעירך] צעיריך *ד2*   87 היום] היום היום *ד2* / לעבדך] בזאת לי *ש*   88 שומח] שמח *ש*   89 בושר] בשר *ש* / הישרף] הושרף *ד2*      90 בחמה] בחימה *ד2* / בבעירה] בבערה *ש*   91 דלתות ... צר] דלת במקום צר והושע לעבדך *ק* *ש*   93 וכוכבים] וככבים *ש*   96 כיום] סיום _ומעל הסמ"ך מתוקן כ"ף_ *ק* / והראם] והראה *ש* *ק*   98 כולם] כלם *ש*   99 נמכרו] נמכר *ק*   101 אדנים] אדונים *ש* *ק* *ד2* / ומכים] _בשוליים נוסף:_ מלשון מך *ש* / מלכים] מלאכים *ק* / ברירה] בבירה *ד2*   102 והיו] והיה *ש*   103 בם] בה *ק* / כעוללות] כעולילות *ד2* / בכרם] ~ביום~ בכרם *ש*   108 סלון] סילון *ש*   111 מצאום] מצאו *ד2*   112 וחום] בחום *ד2* / ובעלית] ובעליית *ק*   113 עליהם ... הצעירה] _נוסף בשוליים במאונך_ *ש* / ניני] ילדי *ש* / יענים] יעינים *ק* *ד2* / ותרקוד] ותרקד *ש* *ל2*   114 ויכרו] ויברו _ובשוליים תוקן:_ ויבכוות\' *ש* ויברו *ל2* / לחומימו] לחוממו *ק*   115 וקרקרנו בנקם] והרקדנו בנאם *ל2* / בנקם] ~ב~ בנקם *ש*   117 וחזרנו ולא נפקד] ושבנו מבלי מפקד *ש* *ק* / חברנו] חבירינו *ש* *ק* חבירנו *ל2*   118 וראש] ויום *ש* / בראש] כראש *פ* _נוסח הפנים לפי_ *ש* *ק* *ל2* / כיום] ביום *פ* _נוסח הפנים לפי_ *ש* *ק* *ל2*   191 כמו] כיום *ש* *ק*   120 ויום] ~ומם~ ויום *ש*   121 בא] בוא *ק* / תשע ותשעים] תשעים ותשע *ש* *ק* / אלי] אילי *ל2*   122 להרגני] להרגיני *ל2* / הגזירה] הגזרה *ק*   123 גלח] גולח *ש* *ק* *ד2*   124 תפשתיו] תפשותיו *ל2* / סהר] סוה.. *ד2* / במגרה] במגירה *ד2* *ל2*   126 וכאשר] ובאשר *ד2* / סחרה] סחורה *ל2* / סחורה] סחרה *ל2*   128 ומלא] ימלא *ד2* / קטורה] טהורה *ד2*   129 בככריו] בכיכריו *ד2* / מתי] ומתי *פ* _נוסח הפנים לפי_ *ש* / באגורה] כאגורה *ד2*   130 שררה] שדרה *ל2*    131 זוכרי] זכרי *ל2* / לרעה] ברעה *ד2* / בלאמים] בלאומי\' *ש* בלאומים *ד2*   132 פעולת] פעלת *ד2* *ל2* / מחתתו] מחיתתו *ש* *ד2*   133 תרומית] תרומיית *ש* *ל2*   134 תפיל] הפיל *ל2* / ויחזיק] ותחזיק *ל2* / מהרה] מהירה *ש* *שב"ק*  135 כי] כן *בק1*   136 ושור] _בספק_: ושורר *ש* / אמרו] גמרו *ל2*   137 השירה] השיר *ש* / לשרה] לשירה *ד2*   138 במרבדים] כמרבדים *ד2* / כספירים] בספירים *ד2*   139 ממלאים] ממולאים *ד2*   142 תמולא] תמלא *ש* *ד2*   143 ותודה] ~ב~ ותודה *ש*   144 לו] לי *ד11* / ולתומכים] ולתמוכים *ד2* / לתורה] בתורה *ש* *ד2*   145 וסעף] וסיעף *ד2* / ופארה] ופורה *פ* *ד2* _נוסח הפנים לפי_ *ש*   146 וצען] וצוען *ש* *ד2* ..צוען *ד11*  147 בי רב] בירב *ד2* *ד11* / וסורא] בסורא *ש* בסורה *ד2* *ד11*   148 למקרה] למקרא *ד2* / אחשורש] אחשורוש *ש* *ד2* *ד11*   149 וכתבוה] ובתבוה [!] *ד2*'
# test = '1 עוז] עז *ק*   4 בשמך] בשמחה *ש*   5 קטנים] ~עצומי~ קטנים *פ*    6 אל] אז *ש* / יתירה] יתרה *ש*   7 חבי] חבה *ש*   8 בתמהון] בתימהון *ש* / יי] ה\' *ש* ייי *ק*   10 כורתים] כורת *ש* *ק* / בריתם] בריתו *ש* *ק* / ולי] ויש *ש*   11 מעשה] מעשי *ש*   12 לחוף] בלב *ק*   14 אינה] לא היא *ק*   18 וחבר] ודבר *ש*   20 זאת] זה *ש*   22 בדה] בדא *ק*   23 להכרית] ..מיד *ה3*   24 האזין] שת _ותוקן בין השיטים_ *ה3* / דבריו] דברו *ק* החסרה] החסירה *ה3*   25 מעטים] מעוטים *ה3* ביום צרה עכורה] לנפשי העכורה *ש*   31 ואפו] ואפי *ק*   32 כפיר] בפיד *ד2*   34 ושלח ... עבירה] _חסר_ *ד2*   35 שלום] השקט; _יתר הבית מחוק, ומסתבר שסדר המילים הוחלף_ *ק* / גופו] גופה, _ה\' סומנה בשתי נקודות למעלה_ *פ* _נוסח הפנים לפי_ *ש* *ד2*   36 שלח ... פשרה] _חסר_ *ד2* / מדינים] מדיינים *ש*   37 אין] איין *ד2*   38 השיב] א.. *ד2* / שאלתך] שאילתך *ד2* ..אילתך *ג1* / מארה] מאירה *ד2* *ג1*   40 והוקש] והרע *ש* *ק* / לו] לי *ש*   41 חייליו] חיליו *ד2*   42 חפורה] _והמעתיק החל לכתוב_ ע, _זיהה את שגיאתו וסימנהּ למחיקה_ *פ*   43 ומהר] ומיהר *ק* / רוח] כרוב *ש*   46 אהלו] אהלה *ד2*   47 לבבינו] לבבנו *ג1* / כאילו] כאלו *ק* *ג1* / שיארה] שיירה *ש* *ק*   49 צוררי] ~צוררי~ צוררי *ש*   50 אזי] _ראש המילה מחוק_ *פ* _הושלם לפי_ *ש* *ק* *ד2* / חנית רמח] רומח חנית  _ובין השיטים הורה המעתיק על סדר המילים שבנוסחתנו_ *ש*   51 צור] צורי *ד2*   52 החילות] החיילות *ש* *ק* ..חיילות *ד2*   52 צר] _בספק_: צור *ש* / בשורה] כשורה *ד2*   53 יחשבון] יחשבו *ש* *ק* *ד2* / וחמה] וחימה *ש* *ק*   54 מבקש] יבקש *ק*   55 עמרה] עמורה *ש*   56 ופנים ... קדרה] _חסר_ *ד2* / פרור] פארור *ש*   58 סעירה] סערה *ד2*   59 בעמדיה] בעמידה *ד2* / כאלו] כאילו *ד2*   והגבות] והגופים *ד2*   68 בדתיהם] בדתותם *ד2*   70 עתרה] עתירה *ד2*   75 והגיוני] ..יוניי *ד2*   80 פדיני] פדני *ש* / מידי] מן ידי *ש* / קטב] קטבי *ד2*   81 זכר] זכור *ש*   82 עמד] עמוד *ש* *ד2* / לו] לי *ש* / במרורה] במדורה *ש* *ד2*   83 שוכן] שוכב *ש* *ד2* / במכפלה] במשכבה *ד2* / עלו] עלה *ד2*    84 ואמרו] וקראו *ד2*   85 ידידי] ידידיי *ד2*   86 יהוסף] _נכתב_ שמואל_, צוין למחיקה ותוקן_ *פ* / צעירך] צעיריך *ד2*   87 היום] היום היום *ד2* / לעבדך] בזאת לי *ש*   88 שומח] שמח *ש*   89 בושר] בשר *ש* / הישרף] הושרף *ד2*      90 בחמה] בחימה *ד2* / בבעירה] בבערה *ש*   91 דלתות ... צר] דלת במקום צר והושע לעבדך *ק* *ש*   93 וכוכבים] וככבים *ש*   96 כיום] סיום _ומעל הסמ"ך מתוקן כ"ף_ *ק* / והראם] והראה *ש* *ק*   98 כולם] כלם *ש*   99 נמכרו] נמכר *ק*   101 אדנים] אדונים *ש* *ק* *ד2* / ומכים] _בשוליים נוסף:_ מלשון מך *ש* / מלכים] מלאכים *ק* / ברירה] בבירה *ד2*   102 והיו] והיה *ש*   103 בם] בה *ק* / כעוללות] כעולילות *ד2* / בכרם] ~ביום~ בכרם *ש*   108 סלון] סילון *ש*   111 מצאום] מצאו *ד2*   112 וחום] בחום *ד2* / ובעלית] ובעליית *ק*   113 עליהם ... הצעירה] _נוסף בשוליים במאונך_ *ש* / ניני] ילדי *ש* / יענים] יעינים *ק* *ד2* / ותרקוד] ותרקד *ש* *ל2*   114 ויכרו] ויברו _ובשוליים תוקן:_ ויבכוות\' *ש* ויברו *ל2* / לחומימו] לחוממו *ק*   115 וקרקרנו בנקם] והרקדנו בנאם *ל2* / בנקם] ~ב~ בנקם *ש*   117 וחזרנו ולא נפקד] ושבנו מבלי מפקד *ש* *ק* / חברנו] חבירינו *ש* *ק* חבירנו *ל2*   118 וראש] ויום *ש* / בראש] כראש *פ* _נוסח הפנים לפי_ *ש* *ק* *ל2* / כיום] ביום *פ* _נוסח הפנים לפי_ *ש* *ק* *ל2*   191 כמו] כיום *ש* *ק*   120 ויום] ~ומם~ ויום *ש*   121 בא] בוא *ק* / תשע ותשעים] תשעים ותשע *ש* *ק* / אלי] אילי *ל2*   122 להרגני] להרגיני *ל2* / הגזירה] הגזרה *ק*   123 גלח] גולח *ש* *ק* *ד2*   124 תפשתיו] תפשותיו *ל2* / סהר] סוה.. *ד2* / במגרה] במגירה *ד2* *ל2*   126 וכאשר] ובאשר *ד2* / סחרה] סחורה *ל2* / סחורה] סחרה *ל2*   128 ומלא] ימלא *ד2* / קטורה] טהורה *ד2*   129 בככריו] בכיכריו *ד2* / מתי] ומתי *פ* _נוסח הפנים לפי_ *ש* / באגורה] כאגורה *ד2*   130 שררה] שדרה *ל2*    131 זוכרי] זכרי *ל2* / לרעה] ברעה *ד2* / בלאמים] בלאומי\' *ש* בלאומים *ד2*   132 פעולת] פעלת *ד2* *ל2* / מחתתו] מחיתתו *ש* *ד2*   133 תרומית] תרומיית *ש* *ל2*   134 תפיל] הפיל *ל2* / ויחזיק] ותחזיק *ל2* / מהרה] מהירה *ש* *שב"ק*  135 כי] כן *בק1*   136 ושור] _בספק_: ושורר *ש* / אמרו] גמרו *ל2*   137 השירה] השיר *ש* / לשרה] לשירה *ד2*   138 במרבדים] כמרבדים *ד2* / כספירים] בספירים *ד2*   139 ממלאים] ממולאים *ד2*   142 תמולא] תמלא *ש* *ד2*   143 ותודה] ~ב~ ותודה *ש*   144 לו] לי *ד11* / ולתומכים] ולתמוכים *ד2* / לתורה] בתורה *ש* *ד2*   145 וסעף] וסיעף *ד2* / ופארה] ופורה *פ* *ד2* _נוסח הפנים לפי_ *ש*   146 וצען] וצוען *ש* *ד2* ..צוען *ד11*  147 בי רב] בירב *ד2* *ד11* / וסורא] בסורא *ש* בסורה *ד2* *ד11*   148 למקרה] למקרא *ד2* / אחשורש] אחשורוש *ש* *ד2* *ד11*   149 וכתבוה] ובתבוה [!] *ד2*'
# test = '1 עוז] עז *ק*   4 בשמך] בשמחה *ש*   5 קטנים] ~עצומי~ קטנים *פ*    6 אל] אז *ש* / יתירה] יתרה *ש*'

# תנומה בעין מכיר
# test_old = 'וקל ... ושפי] ואמר יכבדהו האל אח"כ מספר על הנסיונות ומשבח לאל ית\' על אשר שמר והציל והצליח ורפא וקראה שירה *ש* / _ללא כותרת_ *קמ*   1 בעין] משן *קמ* / עצלתים] נצלה כי *קמ* / ושפלות] שיפלות *קמ* / משיר] _חסר_ *קמ*   2 לבד] ליבו *קמ* / מנלוז] מכלח *קמ* / דרכים] דרכיים *קמ*   3 ואלם] ואילם *קמ* / כמותי] צויתי *קמ*  / וחך] וחיך *ד1* ואיך *קמ* / כבד שפה] יכבד עתה *קמ*   4 אחר שנותו עשה] שנותי עשו *ד1* / יצוה] וצוה *קמ* / ואבתר] ואבת! *ד1* / ולשתים] ולשתיים *קמ*   5 למאות ורבואות] למאור היבואות *קמ* / לאחד] ~ו~לאחד *ש*   6 כמישאל] כמשַאֵל *קמ* / ומוטבע] ומטבע *ד1*   7 נפשי] נפשו *ד1* *קמ* _/ בצירים] וצירים_ *ד1* *קמ*   _8 לשוני] לשני_ *ד1* / תף] תיף *קמ* / כנור] כינור *קמ*   9 כהכון] כהיכון *קמ* / מיושר] מישר *ד1*   10 כמזלג] במזלג *ד1*   11 כמו ליל] ~כמאזנים~כמו ליל *ש* כמו לולי, _כ"ף תוקנה מבי"ת_ *קמ* / בטלה] בטלא *ד1*   12 בבאי] בבואי *ד1* *קמ* / נחשתים] נחושתיים *קמ*   13 עשותו] עשתו *ד1* / במאה מן] כמיא המן! *קמ* / עברו] עבר *ד1*   14 ולכדי] ולבדי *ד1* / צריכים] צרי..ים *קמ* / דלתים] דלתיים *קמ*   15 ושוב ... באפים] _חסר_ *ש* _נוסח הפנים לפי_ *ד1* / באפים] באפיים *קמ*   16 כיעקב] ביעקב *ד1* / במחנים] במחניים *קמ*   17 נאנשים] לאנשים *ד1* באנשים *קמ* / במצרים] במצריים *קמ*   18 יך] יד *ד1* / עלי] _חסר_ *קמ* / כאויב בלכדו] הוא גם לכדו *קמ* / מערכת] _מתחת למ"ם קו נטוי לסימון סוף הדלת_ *ק* / אגפים] אגפיים *קמ*   19 כחי] כוחי *ק* *קמ* / ופעמים] ופעמיים *קמ*   20 ואראה] והנה *ש* _נוסח הפנים לפי_ *ד1* *ק* *קמ* בכירים] ככירים *ש* _נוסח הפנים לפי_ *ד1* *ק* בכיריים *קמ*   21 ואעטף] ואעטוף *ד1* *ק* *קמ* / כרעים] כרעיים *קמ*   22 כפוף] בכוף *קמ* / כאגמון] כאגמן *קמ* / חלצים] חלציים *קמ*   23 ואשכב] ואשאב *ד1* / בלי] ~ומ~ בלי *קמ* / וממכאוב] ומכאוב *קמ* / ומחומם] ומחומם, _ושמא יש לקרוא:_ מחומי *ד1* / עצמי] עצמי~ם~ *ש* / בין] על *ד1* / שפתים] שפתיים *קמ*   24 ביהץ] ביחץ *ד1* *קמ* / ואגלים] ואגליים *קמ*   25 בבקר] בבוקר *קמ* / ויחשך] אחשך *קמ* / וערבים] וערביים *קמ*   26 ולבי] וליבי *קמ* / בבין] בבן *קמ* / זעה לזעה] זיעה לזיעה *ק* / בינות] בינית *קמ* / יאורים] יש יאורים *קמ* / נהדפים] נהדרפי! *ק*   27 חרדים] חרידים *ק* *קמ* / ויאמרו] ואמרו *ק* ויאמר *קמ* / חיו] היו *ד1* *ק* *קמ* / בכזה] כבזה *ק* / שבועים] שבועיים *קמ*   28 מלאים] מליאים *ק* / מנקש] מנשק *ד1* מנדש *קמ* / לברכים] לברכיים *קמ*   29 ויש גועות] וכשגועות *ד1* ויש טעות *קמ* / לשדים] לשדיים *קמ*   30 כבר בא] כבד פה *קמ* / יחזוני] _בסוף השורה נכתב_ \'יׄחׄ\' _ונוסחתנו הועתקה מחדש בתחילת השורה הבאה_ *ד1* יחליף *קמ* / בכפלים] ככפלים *ק* בכפליים *קמ*   31 לי] לו *קמ* / ממלא] ממלוא *ק* ממליא *קמ* / ועינים] וענים *ק* ועניים *קמ*   32 יראים] יריאים *ק* / רואה] ראה *ד1* / בפניו] בפנים *ד1* בפכו *קמ*   33 שנתים] בשנים *ד1* שנתיים *קמ*   34 חלשי] חולשי *קמ* / זרתים] כזרתים *ד1* *ק* כזרתיים *קמ*   35 אהלי] אהולי! *קמ* / והחלש] והחולש *ד1* *קמ* / לרגלים] לרגליים *קמ*   37 ברע שלש] אשר באו *ש* _נוסח הפנים לפי_ *ד1*   38 צד ... צד] צר ... צר *ש* _נוסח הפנים לפי_ *ד1* / ונגע] בנגע *ד1*   39 ותעב] יתעב *ש* _נוסח הפנים לפי_ *ד1* / והרוס] _בסוף השורה נכתב_ \'וׄהׄכׄ\' _ונוסחתנו הועתקה מחדש בשורה הבאה_ *ד1*   40 והדר] והדור, _והמעתיק ניסה לתקן כך שרי"ש תתלכד עם הוא"ו_ *ד1* / בקרנים] וקרנים *ד1*   41 אגודת] אגודות *ד1*   44 וקומה] _בכה"י הועתקה המילה פעמים ברצף_ *ד1*   45 עברים] ובי עברים *ד1*   47 כהסב] בהסב *ד1* / וריחים] ורחים *ד1*    48 יריכים] ירחים *ד1*   49 ושם] _שי"ן תוקנה מאות אחרת_ *ש* / וחושף] וחשך *ד1*   50 טפחים] כטפחים *ד1*   52 נשאוהו] נשואוהו *ד1*   57 נפתה] נפתח *ד1* / כגומר בדבלים] כגמר לרכלים *ד1*   60 לעובר] לעבר *ד1*   62 לעריץ] לערוץ *ד1*   63 שאולה] שואלה *ד1* / ככפים] בכפים *ד1*   64 במילים] במלים *ד1*   67 ואשח] ואשא *ש* _נוסח הפנים לפי_ *ד1*   68 ורב] ורוב *ד1* / שקלתים] שקולים *ד1* / זכרתיו] זכרתים *ד1*   69 מחסורם] _רי"ש תוקנה מאות אחרת_ *ש* מחסולם, _והמעתיק סימן את דגל הלמ"ד למחיקה כדי להגיע לנוסחתנו_ *ד1*'
# test_old = '1 בעין] משן *קמ* / עצלתים] נצלה כי *קמ* / ושפלות] שיפלות *קמ* / משיר] _חסר_ *קמ*   2 לבד] ליבו *קמ* / מנלוז] מכלח *קמ* / דרכים] דרכיים *קמ*   3 ואלם] ואילם *קמ* / כמותי] צויתי *קמ*  / וחך] וחיך *ד1* ואיך *קמ* / כבד שפה] יכבד עתה *קמ*   4 אחר שנותו עשה] שנותי עשו *ד1* / יצוה] וצוה *קמ* / ואבתר] ואבת! *ד1* / ולשתים] ולשתיים *קמ*   5 למאות ורבואות] למאור היבואות *קמ* / לאחד] ~ו~לאחד *ש*   6 כמישאל] כמשַאֵל *קמ* / ומוטבע] ומטבע *ד1*   7 נפשי] נפשו *ד1* *קמ* _/ בצירים] וצירים_ *ד1* *קמ*   _8 לשוני] לשני_ *ד1* / תף] תיף *קמ* / כנור] כינור *קמ*   9 כהכון] כהיכון *קמ* / מיושר] מישר *ד1*   10 כמזלג] במזלג *ד1*   11 כמו ליל] ~כמאזנים~כמו ליל *ש* כמו לולי, _כ"ף תוקנה מבי"ת_ *קמ* / בטלה] בטלא *ד1*   12 בבאי] בבואי *ד1* *קמ* / נחשתים] נחושתיים *קמ*   13 עשותו] עשתו *ד1* / במאה מן] כמיא המן! *קמ* / עברו] עבר *ד1*   14 ולכדי] ולבדי *ד1* / צריכים] צרי..ים *קמ* / דלתים] דלתיים *קמ*   15 ושוב ... באפים] _חסר_ *ש* _נוסח הפנים לפי_ *ד1* / באפים] באפיים *קמ*   16 כיעקב] ביעקב *ד1* / במחנים] במחניים *קמ*   17 נאנשים] לאנשים *ד1* באנשים *קמ* / במצרים] במצריים *קמ*   18 יך] יד *ד1* / עלי] _חסר_ *קמ* / כאויב בלכדו] הוא גם לכדו *קמ* / מערכת] _מתחת למ"ם קו נטוי לסימון סוף הדלת_ *ק* / אגפים] אגפיים *קמ*   19 כחי] כוחי *ק* *קמ* / ופעמים] ופעמיים *קמ*   20 ואראה] והנה *ש* _נוסח הפנים לפי_ *ד1* *ק* *קמ* בכירים] ככירים *ש* _נוסח הפנים לפי_ *ד1* *ק* בכיריים *קמ*   21 ואעטף] ואעטוף *ד1* *ק* *קמ* / כרעים] כרעיים *קמ*   22 כפוף] בכוף *קמ* / כאגמון] כאגמן *קמ* / חלצים] חלציים *קמ*   23 ואשכב] ואשאב *ד1* / בלי] ~ומ~ בלי *קמ* / וממכאוב] ומכאוב *קמ* / ומחומם] ומחומם, _ושמא יש לקרוא:_ מחומי *ד1* / עצמי] עצמי~ם~ *ש* / בין] על *ד1* / שפתים] שפתיים *קמ*   24 ביהץ] ביחץ *ד1* *קמ* / ואגלים] ואגליים *קמ*   25 בבקר] בבוקר *קמ* / ויחשך] אחשך *קמ* / וערבים] וערביים *קמ*   26 ולבי] וליבי *קמ* / בבין] בבן *קמ* / זעה לזעה] זיעה לזיעה *ק* / בינות] בינית *קמ* / יאורים] יש יאורים *קמ* / נהדפים] נהדרפי! *ק*   27 חרדים] חרידים *ק* *קמ* / ויאמרו] ואמרו *ק* ויאמר *קמ* / חיו] היו *ד1* *ק* *קמ* / בכזה] כבזה *ק* / שבועים] שבועיים *קמ*   28 מלאים] מליאים *ק* / מנקש] מנשק *ד1* מנדש *קמ* / לברכים] לברכיים *קמ*   29 ויש גועות] וכשגועות *ד1* ויש טעות *קמ* / לשדים] לשדיים *קמ*   30 כבר בא] כבד פה *קמ* / יחזוני] _בסוף השורה נכתב_ \'יׄחׄ\' _ונוסחתנו הועתקה מחדש בתחילת השורה הבאה_ *ד1* יחליף *קמ* / בכפלים] ככפלים *ק* בכפליים *קמ*   31 לי] לו *קמ* / ממלא] ממלוא *ק* ממליא *קמ* / ועינים] וענים *ק* ועניים *קמ*   32 יראים] יריאים *ק* / רואה] ראה *ד1* / בפניו] בפנים *ד1* בפכו *קמ*   33 שנתים] בשנים *ד1* שנתיים *קמ*   34 חלשי] חולשי *קמ* / זרתים] כזרתים *ד1* *ק* כזרתיים *קמ*   35 אהלי] אהולי! *קמ* / והחלש] והחולש *ד1* *קמ* / לרגלים] לרגליים *קמ*   37 ברע שלש] אשר באו *ש* _נוסח הפנים לפי_ *ד1*   38 צד ... צד] צר ... צר *ש* _נוסח הפנים לפי_ *ד1* / ונגע] בנגע *ד1*   39 ותעב] יתעב *ש* _נוסח הפנים לפי_ *ד1* / והרוס] _בסוף השורה נכתב_ \'וׄהׄכׄ\' _ונוסחתנו הועתקה מחדש בשורה הבאה_ *ד1*   40 והדר] והדור, _והמעתיק ניסה לתקן כך שרי"ש תתלכד עם הוא"ו_ *ד1* / בקרנים] וקרנים *ד1*   41 אגודת] אגודות *ד1*   44 וקומה] _בכה"י הועתקה המילה פעמים ברצף_ *ד1*   45 עברים] ובי עברים *ד1*   47 כהסב] בהסב *ד1* / וריחים] ורחים *ד1*    48 יריכים] ירחים *ד1*   49 ושם] _שי"ן תוקנה מאות אחרת_ *ש* / וחושף] וחשך *ד1*   50 טפחים] כטפחים *ד1*   52 נשאוהו] נשואוהו *ד1*   57 נפתה] נפתח *ד1* / כגומר בדבלים] כגמר לרכלים *ד1*   60 לעובר] לעבר *ד1*   62 לעריץ] לערוץ *ד1*   63 שאולה] שואלה *ד1* / ככפים] בכפים *ד1*   64 במילים] במלים *ד1*   67 ואשח] ואשא *ש* _נוסח הפנים לפי_ *ד1*   68 ורב] ורוב *ד1* / שקלתים] שקולים *ד1* / זכרתיו] זכרתים *ד1*   69 מחסורם] _רי"ש תוקנה מאות אחרת_ *ש* מחסולם, _והמעתיק סימן את דגל הלמ"ד למחיקה כדי להגיע לנוסחתנו_ *ד1*'
# test = 'וקל ... ושפי] ואמר יכבדהו האל אח"כ מספר על הנסיונות ומשבח לאל ית\' על אשר שמר והציל והצליח ורפא וקראה שירה *ש* / _ללא כותרת_ *קמ*   1 בעין] משן *קמ* / עצלתים] נצלה כי *קמ* / ושפלות] שיפלות *קמ* / משיר] _חסר_ *קמ*   2 לבד] ליבו *קמ* / מנלוז] מכלח *קמ* / דרכים] דרכיים *קמ*   3 ואלם] ואילם *קמ* / כמותי] צויתי *קמ*  / וחך] וחיך *ד1* ואיך *קמ* / כבד שפה] יכבד עתה *קמ*   4 אחר שנותו עשה] שנותי עשו *ד1* / יצוה] וצוה *קמ* / ואבתר] ואבת! *ד1* / ולשתים] ולשתיים *קמ*   5 למאות ורבואות] למאור היבואות *קמ* / לאחד] ~ו~לאחד *ש*   6 כמישאל] כמשַאֵל *קמ* / ומוטבע] ומטבע *ד1*   7 נפשי] נפשו *ד1* *קמ* / בצירים] וצירים *ד1* *קמ*   8 לשוני] לשני *ד1* / תף] תיף *קמ* / כנור] כינור *קמ*   9 כהכון] כהיכון *קמ* / מיושר] מישר *ד1*   10 כמזלג] במזלג *ד1*   11 כמו ליל] ~כמאזנים~כמו ליל *ש* כמו לולי, _כ"ף תוקנה מבי"ת_ *קמ* / בטלה] בטלא *ד1*   12 בבאי] בבואי *ד1* *קמ* / נחשתים] נחושתיים *קמ*   13 עשותו] עשתו *ד1* / במאה מן] כמיא המן! *קמ* / עברו] עבר *ד1*   14 ולכדי] ולבדי *ד1* / צריכים] צרי..ים *קמ* / דלתים] דלתיים *קמ*   15 ושוב ... באפים] _חסר_ *ש* _נוסח הפנים לפי_ *ד1* / באפים] באפיים *קמ*   16 כיעקב] ביעקב *ד1* / במחנים] במחניים *קמ*   17 נאנשים] לאנשים *ד1* באנשים *קמ* / במצרים] במצריים *קמ*   18 יך] יד *ד1* / עלי] _חסר_ *קמ* / כאויב בלכדו] הוא גם לכדו *קמ* / מערכת] _מתחת למ"ם קו נטוי לסימון סוף הדלת_ *ק* / אגפים] אגפיים *קמ*   19 כחי] כוחי *ק* *קמ* / ופעמים] ופעמיים *קמ*   20 ואראה] והנה *ש* _נוסח הפנים לפי_ *ד1* *ק* *קמ* / בכירים] ככירים *ש* _נוסח הפנים לפי_ *ד1* *ק* בכיריים *קמ*   21 ואעטף] ואעטוף *ד1* *ק* *קמ* / כרעים] כרעיים *קמ*   22 כפוף] בכוף *קמ* / כאגמון] כאגמן *קמ* / חלצים] חלציים *קמ*   23 ואשכב] ואשאב *ד1* / בלי] ~ומ~ בלי *קמ* / וממכאוב] ומכאוב *קמ* / ומחומם] ומחומם, _ושמא יש לקרוא:_ מחומי *ד1* / עצמי] עצמי~ם~ *ש* / בין] על *ד1* / שפתים] שפתיים *קמ*   24 ביהץ] ביחץ *ד1* *קמ* / ואגלים] ואגליים *קמ*   25 בבקר] בבוקר *קמ* / ויחשך] אחשך *קמ* / וערבים] וערביים *קמ*   26 ולבי] וליבי *קמ* / בבין] בבן *קמ* / זעה לזעה] זיעה לזיעה *ק* / בינות] בינית *קמ* / יאורים] יש יאורים *קמ* / נהדפים] נהדרפי! *ק*   27 חרדים] חרידים *ק* *קמ* / ויאמרו] ואמרו *ק* ויאמר *קמ* / חיו] היו *ד1* *ק* *קמ* / בכזה] כבזה *ק* / שבועים] שבועיים *קמ*   28 מלאים] מליאים *ק* / מנקש] מנשק *ד1* מנדש *קמ* / לברכים] לברכיים *קמ*   29 ויש גועות] וכשגועות *ד1* ויש טעות *קמ* / לשדים] לשדיים *קמ*   30 כבר בא] כבד פה *קמ* / יחזוני] _בסוף השורה נכתב_ \'יׄחׄ\' _ונוסחתנו הועתקה מחדש בתחילת השורה הבאה_ *ד1* יחליף *קמ* / בכפלים] ככפלים *ק* בכפליים *קמ*   31 לי] לו *קמ* / ממלא] ממלוא *ק* ממליא *קמ* / ועינים] וענים *ק* ועניים *קמ*   32 יראים] יריאים *ק* / רואה] ראה *ד1* / בפניו] בפנים *ד1* בפכו *קמ*   33 שנתים] בשנים *ד1* שנתיים *קמ*   34 חלשי] חולשי *קמ* / זרתים] כזרתים *ד1* *ק* כזרתיים *קמ*   35 אהלי] אהולי! *קמ* / והחלש] והחולש *ד1* *קמ* / לרגלים] לרגליים *קמ*   37 ברע שלש] אשר באו *ש* _נוסח הפנים לפי_ *ד1*   38 צד ... צד] צר ... צר *ש* _נוסח הפנים לפי_ *ד1* / ונגע] בנגע *ד1*   39 ותעב] יתעב *ש* _נוסח הפנים לפי_ *ד1* / והרוס] _בסוף השורה נכתב_ \'וׄהׄכׄ\' _ונוסחתנו הועתקה מחדש בשורה הבאה_ *ד1*   40 והדר] והדור, _והמעתיק ניסה לתקן כך שרי"ש תתלכד עם הוא"ו_ *ד1* / בקרנים] וקרנים *ד1*   41 אגודת] אגודות *ד1*   44 וקומה] _בכה"י הועתקה המילה פעמים ברצף_ *ד1*   45 עברים] ובי עברים *ד1*   47 כהסב] בהסב *ד1* / וריחים] ורחים *ד1*    48 יריכים] ירחים *ד1*   49 ושם] _שי"ן תוקנה מאות אחרת_ *ש* / וחושף] וחשך *ד1*   50 טפחים] כטפחים *ד1*   52 נשאוהו] נשואוהו *ד1*   57 נפתה] נפתח *ד1* / כגומר בדבלים] כגמר לרכלים *ד1*   60 לעובר] לעבר *ד1*   62 לעריץ] לערוץ *ד1*   63 שאולה] שואלה *ד1* / ככפים] בכפים *ד1*   64 במילים] במלים *ד1*   67 ואשח] ואשא *ש* _נוסח הפנים לפי_ *ד1*   68 ורב] ורוב *ד1* / שקלתים] שקולים *ד1* / זכרתיו] זכרתים *ד1*   69 מחסורם] _רי"ש תוקנה מאות אחרת_ *ש* מחסולם, _והמעתיק סימן את דגל הלמ"ד למחיקה כדי להגיע לנוסחתנו_ *ד1*'
# test = '1 בעין] משן *קמ* / עצלתים] נצלה כי *קמ* / ושפלות] שיפלות *קמ* / משיר] _חסר_ *קמ*   2 לבד] ליבו *קמ* / מנלוז] מכלח *קמ* / דרכים] דרכיים *קמ*   3 ואלם] ואילם *קמ* / כמותי] צויתי *קמ*  / וחך] וחיך *ד1* ואיך *קמ* / כבד שפה] יכבד עתה *קמ*   4 אחר שנותו עשה] שנותי עשו *ד1* / יצוה] וצוה *קמ* / ואבתר] ואבת! *ד1* / ולשתים] ולשתיים *קמ*   5 למאות ורבואות] למאור היבואות *קמ* / לאחד] ~ו~לאחד *ש*   6 כמישאל] כמשַאֵל *קמ* / ומוטבע] ומטבע *ד1*   7 נפשי] נפשו *ד1* *קמ* / בצירים] וצירים *ד1* *קמ*   8 לשוני] לשני *ד1* / תף] תיף *קמ* / כנור] כינור *קמ*   9 כהכון] כהיכון *קמ* / מיושר] מישר *ד1*   10 כמזלג] במזלג *ד1*   11 כמו ליל] ~כמאזנים~כמו ליל *ש* כמו לולי, _כ"ף תוקנה מבי"ת_ *קמ* / בטלה] בטלא *ד1*   12 בבאי] בבואי *ד1* *קמ* / נחשתים] נחושתיים *קמ*   13 עשותו] עשתו *ד1* / במאה מן] כמיא המן! *קמ* / עברו] עבר *ד1*   14 ולכדי] ולבדי *ד1* / צריכים] צרי..ים *קמ* / דלתים] דלתיים *קמ*   15 ושוב ... באפים] _חסר_ *ש* _נוסח הפנים לפי_ *ד1* / באפים] באפיים *קמ*   16 כיעקב] ביעקב *ד1* / במחנים] במחניים *קמ*   17 נאנשים] לאנשים *ד1* באנשים *קמ* / במצרים] במצריים *קמ*   18 יך] יד *ד1* / עלי] _חסר_ *קמ* / כאויב בלכדו] הוא גם לכדו *קמ* / מערכת] _מתחת למ"ם קו נטוי לסימון סוף הדלת_ *ק* / אגפים] אגפיים *קמ*   19 כחי] כוחי *ק* *קמ* / ופעמים] ופעמיים *קמ*   20 ואראה] והנה *ש* _נוסח הפנים לפי_ *ד1* *ק* *קמ* / בכירים] ככירים *ש* _נוסח הפנים לפי_ *ד1* *ק* בכיריים *קמ*   21 ואעטף] ואעטוף *ד1* *ק* *קמ* / כרעים] כרעיים *קמ*   22 כפוף] בכוף *קמ* / כאגמון] כאגמן *קמ* / חלצים] חלציים *קמ*   23 ואשכב] ואשאב *ד1* / בלי] ~ומ~ בלי *קמ* / וממכאוב] ומכאוב *קמ* / ומחומם] ומחומם, _ושמא יש לקרוא:_ מחומי *ד1* / עצמי] עצמי~ם~ *ש* / בין] על *ד1* / שפתים] שפתיים *קמ*   24 ביהץ] ביחץ *ד1* *קמ* / ואגלים] ואגליים *קמ*   25 בבקר] בבוקר *קמ* / ויחשך] אחשך *קמ* / וערבים] וערביים *קמ*   26 ולבי] וליבי *קמ* / בבין] בבן *קמ* / זעה לזעה] זיעה לזיעה *ק* / בינות] בינית *קמ* / יאורים] יש יאורים *קמ* / נהדפים] נהדרפי! *ק*   27 חרדים] חרידים *ק* *קמ* / ויאמרו] ואמרו *ק* ויאמר *קמ* / חיו] היו *ד1* *ק* *קמ* / בכזה] כבזה *ק* / שבועים] שבועיים *קמ*   28 מלאים] מליאים *ק* / מנקש] מנשק *ד1* מנדש *קמ* / לברכים] לברכיים *קמ*   29 ויש גועות] וכשגועות *ד1* ויש טעות *קמ* / לשדים] לשדיים *קמ*   30 כבר בא] כבד פה *קמ* / יחזוני] _בסוף השורה נכתב_ \'יׄחׄ\' _ונוסחתנו הועתקה מחדש בתחילת השורה הבאה_ *ד1* יחליף *קמ* / בכפלים] ככפלים *ק* בכפליים *קמ*   31 לי] לו *קמ* / ממלא] ממלוא *ק* ממליא *קמ* / ועינים] וענים *ק* ועניים *קמ*   32 יראים] יריאים *ק* / רואה] ראה *ד1* / בפניו] בפנים *ד1* בפכו *קמ*   33 שנתים] בשנים *ד1* שנתיים *קמ*   34 חלשי] חולשי *קמ* / זרתים] כזרתים *ד1* *ק* כזרתיים *קמ*   35 אהלי] אהולי! *קמ* / והחלש] והחולש *ד1* *קמ* / לרגלים] לרגליים *קמ*   37 ברע שלש] אשר באו *ש* _נוסח הפנים לפי_ *ד1*   38 צד ... צד] צר ... צר *ש* _נוסח הפנים לפי_ *ד1* / ונגע] בנגע *ד1*   39 ותעב] יתעב *ש* _נוסח הפנים לפי_ *ד1* / והרוס] _בסוף השורה נכתב_ \'וׄהׄכׄ\' _ונוסחתנו הועתקה מחדש בשורה הבאה_ *ד1*   40 והדר] והדור, _והמעתיק ניסה לתקן כך שרי"ש תתלכד עם הוא"ו_ *ד1* / בקרנים] וקרנים *ד1*   41 אגודת] אגודות *ד1*   44 וקומה] _בכה"י הועתקה המילה פעמים ברצף_ *ד1*   45 עברים] ובי עברים *ד1*   47 כהסב] בהסב *ד1* / וריחים] ורחים *ד1*    48 יריכים] ירחים *ד1*   49 ושם] _שי"ן תוקנה מאות אחרת_ *ש* / וחושף] וחשך *ד1*   50 טפחים] כטפחים *ד1*   52 נשאוהו] נשואוהו *ד1*   57 נפתה] נפתח *ד1* / כגומר בדבלים] כגמר לרכלים *ד1*   60 לעובר] לעבר *ד1*   62 לעריץ] לערוץ *ד1*   63 שאולה] שואלה *ד1* / ככפים] בכפים *ד1*   64 במילים] במלים *ד1*   67 ואשח] ואשא *ש* _נוסח הפנים לפי_ *ד1*   68 ורב] ורוב *ד1* / שקלתים] שקולים *ד1* / זכרתיו] זכרתים *ד1*   69 מחסורם] _רי"ש תוקנה מאות אחרת_ *ש* מחסולם, _והמעתיק סימן את דגל הלמ"ד למחיקה כדי להגיע לנוסחתנו_ *ד1*'

# Parse the test string
parsed = pp_full_apparatus.parseString(test)

# Print the parsed result
variant_list = []
for line_apparatus in parsed['lines']:
    line = line_apparatus['line']
    for lemma_apparatus in line_apparatus['lemmata']:
        lemma = lemma_apparatus['lemma']
        for variant in lemma_apparatus['variants']:
            variant_text = variant['text']
            manuscripts = variant['sources']
            print(f"Line: {line}  |  Correction from: {' '.join(lemma)}, to: {' '.join(variant_text)}, in manuscripts: {manuscripts}")
            for manuscript in manuscripts:
                variant_list.append({
                    'line': line,
                    'lemma': ' '.join(lemma),
                    'text': ' '.join(variant_text),
                    'manuscript': manuscript
                })

def extract_comment(parsed_text):
    if "italic" in parsed_text:
        comment = ' '.join(parsed_text['italic'])
    else:
        comment = None
    return comment
def extract_comment_raw(text):
    if "_" in text:
        comment = ''.join([character for character in text[text.index('_')+1:] if character not in "_~*"]).strip()
    else:
        comment = None
    return comment

import difflib

char_diff = list(difflib.ndiff(variant_list[-2]['lemma'], variant_list[-2]['text']))
added_chars = [char for char in char_diff if char.startswith('+ ')]

removed_chars = [char for char in char_diff if char.startswith('- ')]


test = variant_list[0]

correction_list = []
for test in variant_list:
    match = re.search(r'_.*\bחסר\b.*_', test['text'])
    if match:
        correction = MissingApparatus(
            song_name='אלוה עז',
            line=test['line'],
            lemma=test['lemma'],
            source='ש',
            target=test['manuscript']
        )
    elif "~" in test['text']:
        # parsed_strike_through = re.search(r'~(.*?)~', test)
        # parsed_strike_through_text = parsed_strike_through.group(1).strip()
        parsed_strike_through = complex_sentence.parseString(test['text'])
        deleted = ' '.join(parsed_strike_through['strike'])
        corrected = ' '.join(parsed_strike_through['regular'])

        comment = extract_comment_raw(test['text'])
        if deleted != corrected:
            correction = DeletionApparatus(deleted=deleted,
                                           corrected=corrected,
                                           song_name='אלוה עז',
                                           line=test['line'],
                                           lemma=test['lemma'],
                                           source='ש',
                                           target=test['manuscript'],
                                           comment=comment)
    else:
        comment = extract_comment_raw(test['text'])
        parsed_text = complex_sentence.parseString(test['text'])
        if 'regular' not in parsed_text:
            # just a comment without correction
            # comment = extract_comment(parsed_text)
            correction = Apparatus(
                song_name='אלוה עז',
                line=test['line'],
                lemma=test['lemma'],
                source='ש',
                target=test['manuscript'],
                comment=comment
            )

        else:
            # check if same number of words
            correction_text = ' '.join(parsed_text['regular'])

            # print(f"before strip: {correction_text}")
            correction_text = correction_text.strip("!?,:\'\"[](); ")
            # print(f"after strip: {correction_text}")

            if len(test['lemma'].split()) != len(correction_text.split()):
                # comment = extract_comment(parsed_text)
                correction = WordSwapApparatus(
                    text=' '.join(parsed_text['regular']),
                    song_name='אלוה עז',
                    line=test['line'],
                    lemma=test['lemma'],
                    source='ש',
                    target=test['manuscript'],
                    comment=comment
                )
            else:
                ## compare letters
                # check if first or last letters are אהוי, and if so remove them for the comparison
                lemma_to_compare = test['lemma']
                correction_to_compare = correction_text

                if correction_to_compare[0] in 'אהוי':
                    correction_to_compare = correction_to_compare[1:]
                if len(correction_to_compare) > 0 and correction_to_compare[-1] in 'אהוי':
                    correction_to_compare = correction_to_compare[:-1]
                if lemma_to_compare[0] in 'אהוי':
                    lemma_to_compare = lemma_to_compare[1:]
                if len(lemma_to_compare) > 0 and lemma_to_compare[-1] in 'אהוי':
                    lemma_to_compare = lemma_to_compare[:-1]

                char_diff = list(difflib.ndiff(lemma_to_compare, correction_to_compare))

                added_chars = [char[2:] for char in char_diff if char.startswith('+ ')]
                removed_chars = [char[2:] for char in char_diff if char.startswith('- ')]

                only_ahevi = True
                for char in set(added_chars + removed_chars):
                    if char not in 'אהוי':
                        only_ahevi = False
                        break

                only_added_or_removed = ((len(removed_chars) > 0 and len(added_chars) == 0) or (len(removed_chars) == 0 and len(added_chars) > 0))
                if only_ahevi and only_added_or_removed:
                    # comment = extract_comment(parsed_text)
                    correction = FullSpellingApparatus(
                        text=correction_text,
                        song_name='אלוה עז',
                        line=test['line'],
                        lemma=test['lemma'],
                        source='ש',
                        target=test['manuscript'],
                        comment=comment
                    )
                else:
                    # check word lengths
                    same_lengths = True
                    for i in range(len(correction_text.split())):
                        if len(correction_text.split()[i]) != len(test['lemma'].split()[i]):
                            same_lengths = False
                            break

                    if not same_lengths:
                        # comment = extract_comment(parsed_text)
                        correction = WordSwapApparatus(
                            text=correction_text,
                            song_name='אלוה עז',
                            line=test['line'],
                            lemma=test['lemma'],
                            source='ש',
                            target=test['manuscript'],
                            comment=comment
                        )

                    else:
                        # diff characters again, now with full text
                        char_diff = list(difflib.ndiff(test['lemma'], correction_text))
                        added_chars = [char[2:] for char in char_diff if char.startswith('+ ')]
                        removed_chars = [char[2:] for char in char_diff if char.startswith('- ')]

                        removal_index = test['lemma'].index(removed_chars[0])
                        insertion_index = correction_text.index(added_chars[0])

                        # check if only word order changed
                        if set(test['lemma'].split()) == set(correction_text.split()):
                            # comment = extract_comment(parsed_text)
                            correction = OrderSwapApparatus(
                                text=correction_text,
                                song_name='אלוה עז',
                                line=test['line'],
                                lemma=test['lemma'],
                                source='ש',
                                target=test['manuscript'],
                                comment=comment
                            )
                        # check if only one letter changed, at the same place
                        elif len(added_chars) == 1 and len(removed_chars) == 1 and removal_index == insertion_index:
                            # letter swap
                            # comment = extract_comment(parsed_text)
                            correction = LetterSwapApparatus(
                                text=correction_text,
                                old_letter=removed_chars[0],
                                new_letter=added_chars[0],
                                song_name='אלוה עז',
                                line=test['line'],
                                lemma=test['lemma'],
                                source='ש',
                                target=test['manuscript'],
                                comment=comment
                            )
                        else:
                            # general word swap
                            # comment = extract_comment(parsed_text)
                            correction = WordSwapApparatus(
                                text=correction_text,
                                song_name='אלוה עז',
                                line=test['line'],
                                lemma=test['lemma'],
                                source='ש',
                                target=test['manuscript'],
                                comment=comment
                            )



    print(correction)
    correction_list.append(correction)

for correction in correction_list:
    print(correction.to_json())
for appratype in set([_.type for _ in correction_list]):
    print(f"Number of {appratype}: {len([_ for _ in correction_list if _.type == appratype])} | Percentage of {appratype}: {len([_ for _ in correction_list if _.type == appratype]) / len(correction_list) * 100:.2f}%")

